In [3]:
import pandas as pd
import numpy as np

In [4]:
#base sgl
baseSql = pd.read_csv('datos/202106/2021-06_ KUNAN.xls - Base SQL.csv')

In [6]:
valores_=baseSql[['nombre', 'tipodoc','numdoc','sexo','fecha_nacimiento','afiliado', 'grado_paren']]

In [7]:
valores_

,nombre,tipodoc,numdoc,sexo,fecha_nacimiento,afiliado,grado_paren
0,ABALLAY MIGUEL ANGEL,DI,7975217,M,23/10/1943,150410698405,0
1,ABALLAY MIGUEL ANGEL,DI,7975217,M,23/10/1943,150410698405,0
2,ABALLAY MIGUEL ANGEL,DI,7975217,M,23/10/1943,150410698405,0
3,ABALLAY MIGUEL ANGEL,DI,7975217,M,23/10/1943,150410698405,0
4,ABALLAY MIGUEL ANGEL,DI,7975217,M,23/10/1943,150410698405,0
...,...,...,...,...,...,...,...
11321,ZARATE ANTONIA ELIDE,DI,3601270,F,28/7/1934,150199396202,0
11322,ZARATE ANTONIA ELIDE,DI,3601270,F,28/7/1934,150199396202,0
11323,ZARATE ANTONIA ELIDE,DI,3601270,F,28/7/1934,150199396202,0
11324,ZARATE ANTONIA ELIDE,DI,3601270,F,28/7/1934,150199396202,0
11325,ZARATE ANTONIA ELIDE,DI,3601270,F,28/7/1934,150199396202,0

In [8]:
valores_.isnull().sum()

nombre              0
tipodoc             0
numdoc              0
sexo                0
fecha_nacimiento    0
afiliado            0
grado_paren         0
dtype: int64

In [9]:
#base del Pami
pami = pd.read_csv('datos/202106/2021-06_ KUNAN.xls - app Pami .csv')

In [10]:
pami.isnull().sum()

N° de Visita                                0
Estado                                      0
Fecha comienzo                              0
Fecha fin                                   0
Duración                                    0
Celular persona afiliada                    0
N° afiliación                               2
Nombre persona afiliada                     2
DNI del responsable de la visita            0
Responsable de la visita                    0
N° matrícula responsable de la visita    1138
Tipo servicio prestador                     0
Email responsable de la visita              0
Razón social de Empresa Prestadora          0
SAP de Empresa Prestadora                   0
UGL de Empresa Prestadora                   0
dtype: int64

In [11]:
#any trae los true si son nulos
pami.isnull().any()

N° de Visita                             False
Estado                                   False
Fecha comienzo                           False
Fecha fin                                False
Duración                                 False
Celular persona afiliada                 False
N° afiliación                             True
Nombre persona afiliada                   True
DNI del responsable de la visita         False
Responsable de la visita                 False
N° matrícula responsable de la visita     True
Tipo servicio prestador                  False
Email responsable de la visita           False
Razón social de Empresa Prestadora       False
SAP de Empresa Prestadora                False
UGL de Empresa Prestadora                False
dtype: bool

In [100]:
#renombrar columnas para poder acceder luego
pami.columns = ['NVisita','Estado', 'FechaInc','FechaFin','Duracion','Celular','NAfiliacion','Nombre','DNI','Responsable','Matricula','Prestador','Email','RazonSocial','SAP','UGL']

In [101]:
pami.columns

Index(['NVisita', 'Estado', 'FechaInc', 'FechaFin', 'Duracion', 'Celular',
       'NAfiliacion', 'Nombre', 'DNI', 'Responsable', 'Matricula', 'Prestador',
       'Email', 'RazonSocial', 'SAP', 'UGL'],
      dtype='object')

In [102]:
valores_nulos_pami = pami [['NAfiliacion','Nombre','DNI',]]

In [103]:
valores_nulos_pami.isnull().sum()

NAfiliacion    2
Nombre         2
DNI            0
dtype: int64

In [104]:
valores_nulos_pami

       NAfiliacion                     Nombre       DNI
0     1.507742e+13           BUSTOS JUAN JOSE  36187718
1     1.502981e+13          PAVON MARTA NOEMI  31556997
2     9.595341e+12        GAUTA CELIA MARTINA  26448117
3     1.501929e+13  CONTRERA REIMUNDA DELICIA  34621138
4     1.502615e+13        GONZALEZ MARIA ROSA  16827652
...            ...                        ...       ...
8572  1.558042e+13    ARIAS SUSANA DEL CARMEN  16827652
8573  1.503379e+13             PARISE MAFALDA  34356403
8574  1.506716e+13       TULA MARTA DEL VALLE  16827652
8575  1.558042e+13    ARIAS SUSANA DEL CARMEN  26904513
8576  1.400066e+13   JUNCOS LILIANA DEL VALLE  42692716

[8577 rows x 3 columns]

In [105]:
pwd

'/home/sabri/Escritorio/EnCasa/proyecto_encasa/en-casa-presentaciones-pami'

In [ ]:
#Creo un archivo de salida

In [106]:
valores_nulos_pami.reset_index().to_csv('Datos faltantes.csv',header=True, index=False)

In [107]:
valores_nulos_pami

       NAfiliacion                     Nombre       DNI
0     1.507742e+13           BUSTOS JUAN JOSE  36187718
1     1.502981e+13          PAVON MARTA NOEMI  31556997
2     9.595341e+12        GAUTA CELIA MARTINA  26448117
3     1.501929e+13  CONTRERA REIMUNDA DELICIA  34621138
4     1.502615e+13        GONZALEZ MARIA ROSA  16827652
...            ...                        ...       ...
8572  1.558042e+13    ARIAS SUSANA DEL CARMEN  16827652
8573  1.503379e+13             PARISE MAFALDA  34356403
8574  1.506716e+13       TULA MARTA DEL VALLE  16827652
8575  1.558042e+13    ARIAS SUSANA DEL CARMEN  26904513
8576  1.400066e+13   JUNCOS LILIANA DEL VALLE  42692716

[8577 rows x 3 columns]

In [108]:
valores_nulos_pami.isnull().sum().sum()

4

In [109]:
valores_nulos_pami.isnull().any()

NAfiliacion     True
Nombre          True
DNI            False
dtype: bool

In [110]:
#Encuentro el indice de los nulos en el dataframe valores_nulos_pami
null_columns=valores_nulos_pami.columns[valores_nulos_pami.isnull().any()]
valores_nulos_pami[null_columns].isnull().sum()

indx = (valores_nulos_pami[valores_nulos_pami.isnull().any(axis=1)][null_columns].head())
print(indx)

      NAfiliacion Nombre
1125          NaN    NaN
6518          NaN    NaN

In [121]:
data1 =pd.DataFrame(valores_nulos_pami.loc[1125])

In [123]:
data1

                 1125
NAfiliacion       NaN
Nombre            NaN
DNI          34621138

In [122]:
data2 =pd.DataFrame(valores_nulos_pami.loc[6518])

In [128]:
#merge
Indice = pd.concat([data1,data2],axis=1,join='outer')

In [129]:
Indice

                 1125      6518
NAfiliacion       NaN       NaN
Nombre            NaN       NaN
DNI          34621138  18434253

In [130]:
#creo un archivo de salida con los datos faltantes
Indice.to_csv('Datos que faltan.csv',header=True)